/*******************************************************************************
* タイトル:		fieldヘッダー
* プログラム名:	field.h
* 作成者:		GP11A132 99 外岡高明
* 作成日:		2024/05/26
*******************************************************************************/

#pragma once	// インクルードガード（多重インクルード防止）

/*******************************************************************************
* インクルードファイル
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define FIELD_W		(150)	// fieldの横幅
#define FIELD_H		(64)	// fieldの高さ


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitField(void);
void UninitField(void);
void UpdateField(void);
void DrawField(void);


void AddinUI(int startY, int endY, int startX, int endX, int offsetY = 0, int offsetX = 0);

// 指定した座標にdataを書き込む
void SetField(int y, int x, char data);

// 指定した座標に書かれているMAPデータを取得する
char GetField(int y, int x);

// 指定した座標はOKな場所？
// OKな場所なら0
// NGな場所なら0以外
int CheckField(int y, int x);



