/*******************************************************************************
* タイトル:		プレイヤーヘッダー
* プログラム名:	player.h
* 作成者:		GP11A132 99 外岡高明
* 作成日:		2024/05/26
*******************************************************************************/

#pragma once	// インクルードガード（多重インクルード防止）

/*******************************************************************************
* インクルードファイル
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define PLAYER_MAX (1)

/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct PLAYER
{
	int x;				// X座標
	int y;				// Y座標

	int old_x;			// 一歩前のX座標
	int old_y;			// 一歩前のY座標

	int hp;             //生命力
	int hpMax;          //最大生命力

	int flag;           //方向 0:右  1:上  2:左  3:下

	int arrownum;       //持っている矢の数

	int arrowIsOut;     //出た矢の番号

	int attack_x1;
	int attack_y1;

	int attack_x2;
	int attack_y2;

	BOOL isAttack;      //攻撃しているか

	int healNum;   //薬の数

	int heartFraNum;  //生命破片の数

	int keyNum;   //鍵の数

	BOOL isHook;  //かぎ爪使ってるか


};





/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

void Attack(void);

//PLAYER* GetPlayer() {
//	return &g_Player[0];
//}

extern PLAYER g_Player[];

